In [2]:
import sqlite3

In [3]:
db = sqlite3.connect('my_database3.db')

In [41]:
cursor = db.cursor()

In [49]:
cursor.execute("create table score1(gender Text, stud_id INT primary key,marks int)")

In [6]:
cursor.execute("insert INTO score1(gender,stud_id,marks) values('Male',196,56)")

In [50]:
db.commit()

In [51]:
print(cursor.rowcount,'Row inserted')

-1 Row inserted

In [52]:
results = cursor.execute("insert INTO score1(gender,stud_id,marks)values('Female',197,57),('Male',198,34),('Male',199,56)")
db.commit()

In [53]:
results = cursor.execute("select * From score1")
for row in results:
    print(row)

('Female', 197, 57)
('Male', 198, 34)
('Male', 199, 56)

In [54]:
results = cursor.execute("select stud_id, marks From score1")
for row in results:
    print(row)

(197, 57)
(198, 34)
(199, 56)

In [55]:
with open('C:/Users/shail/Downloads/score_file.csv','r') as file:
    no_records = 0
    for row in file:
        cursor.execute("Insert INTO score1 values(?,?,?)",row.split(","))
        db.commit()
        no_records+=1
        
print(no_records,'records_inserted')

9 records_inserted

In [56]:
results = cursor.execute("select * From score1")
for row in results:
    print(row)

('Female', 197, 57)
('Male', 198, 34)
('Male', 199, 56)
('Male', 200, 67)
('Female', 201, 76)
('Male', 202, 45)
('Male', 203, 32)
('Female', 204, 67)
('Male', 205, 20)
('Female', 206, 33)
('Male', 207, 76)
('Male', 208, 90)

In [57]:
sql = "select * FROM score1 Where stud_id = 204"
results = cursor.execute(sql)
for row in results:
    print(row)

('Female', 204, 67)

In [58]:
sql = "Delete From score1 Where stud_id = 204"
db.commit()
cursor.execute(sql)

In [59]:
results = cursor.execute("select * FROM score1")
for row in results:
    print(row)

('Female', 197, 57)
('Male', 198, 34)
('Male', 199, 56)
('Male', 200, 67)
('Female', 201, 76)
('Male', 202, 45)
('Male', 203, 32)
('Male', 205, 20)
('Female', 206, 33)
('Male', 207, 76)
('Male', 208, 90)

In [60]:
results = cursor.execute("select * FROM score1 order by marks desc")
for row in results:
    print(row)

('Male', 208, 90)
('Female', 201, 76)
('Male', 207, 76)
('Male', 200, 67)
('Female', 197, 57)
('Male', 199, 56)
('Male', 202, 45)
('Male', 198, 34)
('Female', 206, 33)
('Male', 203, 32)
('Male', 205, 20)

In [61]:
sql = "Update score1 set marks = 50 Where stud_id = 205"
cursor.execute(sql)

In [62]:
sql = "select * FROM score1 Where stud_id = 205"
results = cursor.execute(sql)
for row in results:
    print(row)

('Male', 205, 50)

In [63]:
sql = "update score1 set marks = 35 WHERE stud_id IN(206,203)"
cursor.execute(sql)

In [24]:
sql = "select * FROM score1 ORDER by stud_id"
results = cursor.execute(sql)
for row in results:
    print(row)

('Male', 196, 56)
('Female', 197, 57)
('Male', 198, 34)
('Male', 199, 56)
('Male', 200, 67)
('Female', 201, 76)
('Male', 202, 45)
('Male', 203, 35)
('Male', 205, 50)
('Female', 206, 35)
('Male', 207, 76)
('Male', 208, 90)

In [64]:
sql = "UPDATE score1 set marks = 50 WHERE stud_id BETWEEN 200 And 203"
cursor.execute(sql)

In [65]:
sql = "select * FROM score1 WHERE stud_id BETWEEN 200 AND 203"
results= cursor.execute(sql)
for row in results:
    print(row)

('Male', 200, 50)
('Female', 201, 50)
('Male', 202, 50)
('Male', 203, 50)

In [66]:
results = cursor.execute("select MIN(marks) FROM score1")
print('Minimum marks = ', results.fetchone())

Minimum marks =  (34,)

In [67]:
results = cursor.execute("select MAx(marks) FROM score1")
print('Maximum marks = ', results.fetchone())

Maximum marks =  (90,)

In [7]:
db = sqlite3.connect("student_course.db")

In [8]:
cur = db.cursor()

In [28]:
cur.execute("create table course1(courseid INT primary key,coursename TEXT,duration INT)")

OperationalError: table course1 already exists

In [29]:
cur.execute("create table student1(roll_no INT primary key,studentname TEXT,age INT,courseid INT,foreign key(courseid) references course1(courseid))")

OperationalError: table student1 already exists

In [32]:
cur.execute("insert INTO course1 Values(10,'Physics',50),(11,'Rohit',31),(12,'Surya',36)")
print(cur.rowcount,'records inserted')
db.commit()

3 records inserted

In [33]:
cur.execute("insert INTO student1 values(100,'Virat',20,10),(101,'Sachin',25,11),(102,'Lax',27,10),(103,'Surya',17,11)")
print(cur.rowcount,'records inserted')
db.commit()

4 records inserted

In [34]:
results = cur.execute("select * FROM course1")
results.fetchall()

[(78, 'Data Science', 12),
 (56, 'python course', 4),
 (101, 'database', 7),
 (10, 'Physics', 50),
 (11, 'Rohit', 31),
 (12, 'Surya', 36)]

In [35]:
results = cur.execute("select * FROM student1")
results.fetchall()

[(1, 'jack', 22, 78),
 (2, 'john', 21, 56),
 (3, 'rudolf', 18, 78),
 (4, 'Jim', 21, 56),
 (100, 'Virat', 20, 10),
 (101, 'Sachin', 25, 11),
 (102, 'Lax', 27, 10),
 (103, 'Surya', 17, 11)]

In [36]:
results = cur.execute("select courseid From course1 Where coursename = 'Data Science'")

for row in results:
    print(row)

(78,)

In [39]:
results = cur.execute('select * FROM student1 Where courseid=(select courseid FROM course1 Where coursename ="Data Science")')
results.fetchall()

[(1, 'jack', 22, 78), (3, 'rudolf', 18, 78)]

In [42]:
cursor.execute("create table students(students_name Text,students_id INT primary key,phone_number INT)")

In [73]:
cursor.execute("insert INTO students(students_name,students_id,phone_number)values('Ram',250,2222222),('Shyam',251,3333333),('Usha',252,44444),('Lata',253,55555)")
db.commit()
result =cursor.execute("select * FROM students")
print('Name  students_id   phone_number \n ==================')
for row in result:
    print(row)

Name  students_id   phone_number
 ==================
('Ram', 200, 2222222)
('Shyam', 201, 3333333)
('Usha', 202, 44444)
('Lata', 204, 55555)
('Ram', 215, 2222222)
('Shyam', 219, 3333333)
('Usha', 220, 44444)
('Lata', 221, 55555)
('Ram', 250, 2222222)
('Shyam', 251, 3333333)
('Usha', 252, 44444)
('Lata', 253, 55555)

In [70]:
result = cursor.execute("select * FROM score1")
for row in result:
    print(row)

('Female', 197, 57)
('Male', 198, 34)
('Male', 199, 56)
('Male', 200, 50)
('Female', 201, 50)
('Male', 202, 50)
('Male', 203, 50)
('Male', 205, 50)
('Female', 206, 35)
('Male', 207, 76)
('Male', 208, 90)

In [75]:
sql = "select students.students_id,students.students_name,score1.gender,score1.marks FROM score1 INNER JOIN students ON students.students_id = score1.stud_id"
results = cursor.execute(sql)
for row in results:
    print(row)

(200, 'Ram', 'Male', 50)
(201, 'Shyam', 'Female', 50)
(202, 'Usha', 'Male', 50)

In [76]:
sql = "select students.students_id,students.students_name,score1.gender,score1.marks FROM students INNER JOIN score1 ON students.students_id = score1.stud_id"
results = cursor.execute(sql)
for row in results:
    print(row)

(200, 'Ram', 'Male', 50)
(201, 'Shyam', 'Female', 50)
(202, 'Usha', 'Male', 50)

In [77]:
sql = "select students.students_id,students.students_name,score1.gender,score1.marks FROM score1 Left JOIN students ON students.students_id = score1.stud_id"
results = cursor.execute(sql)
for row in results:
    print(row)

(None, None, 'Female', 57)
(None, None, 'Male', 34)
(None, None, 'Male', 56)
(200, 'Ram', 'Male', 50)
(201, 'Shyam', 'Female', 50)
(202, 'Usha', 'Male', 50)
(None, None, 'Male', 50)
(None, None, 'Male', 50)
(None, None, 'Female', 35)
(None, None, 'Male', 76)
(None, None, 'Male', 90)

In [78]:
sql = "select students.students_id,students.students_name,score1.gender,score1.marks FROM students Left JOIN score1 ON students.students_id = score1.stud_id"
results = cursor.execute(sql)
for row in results:
    print(row)

(200, 'Ram', 'Male', 50)
(201, 'Shyam', 'Female', 50)
(202, 'Usha', 'Male', 50)
(204, 'Lata', None, None)
(215, 'Ram', None, None)
(219, 'Shyam', None, None)
(220, 'Usha', None, None)
(221, 'Lata', None, None)
(250, 'Ram', None, None)
(251, 'Shyam', None, None)
(252, 'Usha', None, None)
(253, 'Lata', None, None)